main-map.dot
strict digraph "dependency-cruiser output"{
    rankdir="LR" splines="true" overlap="false" nodesep="0.16" ranksep="0.18" fontname="Helvetica-bold" fontsize="9" style="rounded,bold,filled" fillcolor="#ffffff" compound="true"
    node [shape="box" style="rounded, filled" height="0.2" color="black" fillcolor="#ffffcc" fontcolor="black" fontname="Helvetica" fontsize="9"]
    edge [arrowhead="normal" arrowsize="0.6" penwidth="2.0" color="#00000033" fontname="Helvetica" fontsize="9"]

    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/app" {label="app" subgraph "cluster_apps/artists/app/api" {label="api" subgraph "cluster_apps/artists/app/api/auth" {label="auth" subgraph "cluster_apps/artists/app/api/auth/login" {label="login" "apps/artists/app/api/auth/login/route.ts" [label=<route.ts> tooltip="route.ts" URL="apps/artists/app/api/auth/login/route.ts" fillcolor="#ddfeff"] } } } } } }
    "apps/artists/app/api/auth/login/route.ts" -> "apps/artists/core/modules/auth/server/login/controllers/login-get-controller.tsx"
    "apps/artists/app/api/auth/login/route.ts" -> "apps/artists/core/modules/auth/server/login/controllers/login-post-controller.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/app" {label="app" subgraph "cluster_apps/artists/app/api" {label="api" subgraph "cluster_apps/artists/app/api/auth" {label="auth" subgraph "cluster_apps/artists/app/api/auth/logout" {label="logout" "apps/artists/app/api/auth/logout/route.ts" [label=<route.ts> tooltip="route.ts" URL="apps/artists/app/api/auth/logout/route.ts" fillcolor="#ddfeff"] } } } } } }
    "apps/artists/app/api/auth/logout/route.ts" -> "apps/artists/core/modules/auth/server/logout/controllers/logout-get-controller.tsx"
    "apps/artists/app/api/auth/logout/route.ts" -> "apps/artists/core/modules/auth/server/logout/controllers/logout-post-controller.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/app" {label="app" "apps/artists/app/layout.tsx" [label=<layout.tsx> tooltip="layout.tsx" URL="apps/artists/app/layout.tsx" fillcolor="#ccffcc"] } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/app" {label="app" "apps/artists/app/page.tsx" [label=<page.tsx> tooltip="page.tsx" URL="apps/artists/app/page.tsx" fillcolor="#bbfeff"] } } }
    "apps/artists/app/page.tsx" -> "apps/artists/core/modules/landing/page.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" subgraph "cluster_apps/artists/core/modules/auth/client/components" {label="components" subgraph "cluster_apps/artists/core/modules/auth/client/components/anonymous-content" {label="anonymous-content" "apps/artists/core/modules/auth/client/components/anonymous-content/anonymous-content.tsx" [label=<anonymous-content.tsx> tooltip="anonymous-content.tsx" URL="apps/artists/core/modules/auth/client/components/anonymous-content/anonymous-content.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/client/components/anonymous-content/anonymous-content.tsx" -> "apps/artists/core/modules/auth/client/components/login-form/login-form.tsx"
    "apps/artists/core/modules/auth/client/components/anonymous-content/anonymous-content.tsx" -> "apps/artists/core/modules/auth/client/components/register-form/register-form.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" subgraph "cluster_apps/artists/core/modules/auth/client/components" {label="components" subgraph "cluster_apps/artists/core/modules/auth/client/components/auth-section" {label="auth-section" "apps/artists/core/modules/auth/client/components/auth-section/auth-section.tsx" [label=<auth-section.tsx> tooltip="auth-section.tsx" URL="apps/artists/core/modules/auth/client/components/auth-section/auth-section.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/client/components/auth-section/auth-section.tsx" -> "apps/artists/core/modules/auth/client/use-auth.tsx"
    "apps/artists/core/modules/auth/client/components/auth-section/auth-section.tsx" -> "apps/artists/core/modules/auth/client/components/anonymous-content/anonymous-content.tsx"
    "apps/artists/core/modules/auth/client/components/auth-section/auth-section.tsx" -> "apps/artists/core/modules/auth/client/components/members-content/members-content.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" subgraph "cluster_apps/artists/core/modules/auth/client/components" {label="components" subgraph "cluster_apps/artists/core/modules/auth/client/components/login-form" {label="login-form" "apps/artists/core/modules/auth/client/components/login-form/login-form.tsx" [label=<login-form.tsx> tooltip="login-form.tsx" URL="apps/artists/core/modules/auth/client/components/login-form/login-form.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/client/components/login-form/login-form.tsx" -> "apps/artists/core/modules/auth/client/components/login-form/use-login-form.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" subgraph "cluster_apps/artists/core/modules/auth/client/components" {label="components" subgraph "cluster_apps/artists/core/modules/auth/client/components/login-form" {label="login-form" "apps/artists/core/modules/auth/client/components/login-form/use-login-form.tsx" [label=<use-login-form.tsx> tooltip="use-login-form.tsx" URL="apps/artists/core/modules/auth/client/components/login-form/use-login-form.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/client/components/login-form/use-login-form.tsx" -> "apps/artists/core/modules/auth/client/use-auth.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" subgraph "cluster_apps/artists/core/modules/auth/client/components" {label="components" subgraph "cluster_apps/artists/core/modules/auth/client/components/members-content" {label="members-content" "apps/artists/core/modules/auth/client/components/members-content/members-content.tsx" [label=<members-content.tsx> tooltip="members-content.tsx" URL="apps/artists/core/modules/auth/client/components/members-content/members-content.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/client/components/members-content/members-content.tsx" -> "apps/artists/core/modules/auth/client/use-auth.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" subgraph "cluster_apps/artists/core/modules/auth/client/components" {label="components" subgraph "cluster_apps/artists/core/modules/auth/client/components/register-form" {label="register-form" "apps/artists/core/modules/auth/client/components/register-form/register-form.tsx" [label=<register-form.tsx> tooltip="register-form.tsx" URL="apps/artists/core/modules/auth/client/components/register-form/register-form.tsx" fillcolor="#bbfeff"] } } } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" "apps/artists/core/modules/auth/client/use-auth.tsx" [label=<use-auth.tsx> tooltip="use-auth.tsx" URL="apps/artists/core/modules/auth/client/use-auth.tsx" fillcolor="#bbfeff"] } } } } } }
    "apps/artists/core/modules/auth/client/use-auth.tsx" -> "apps/artists/core/modules/auth/domain/service/get-auth-client-cookie.tsx"
    "apps/artists/core/modules/auth/client/use-auth.tsx" -> "apps/artists/core/modules/auth/server/login/login-post-fetch-result.tsx"
    "apps/artists/core/modules/auth/client/use-auth.tsx" -> "apps/artists/core/modules/auth/server/logout/logout-post-fetch.tsx"
    "apps/artists/core/modules/auth/client/use-auth.tsx" -> "apps/artists/core/modules/auth/client/use-effect-once.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/client" {label="client" "apps/artists/core/modules/auth/client/use-effect-once.tsx" [label=<use-effect-once.tsx> tooltip="use-effect-once.tsx" URL="apps/artists/core/modules/auth/client/use-effect-once.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" "apps/artists/core/modules/auth/domain/login-use-case.tsx" [label=<login-use-case.tsx> tooltip="login-use-case.tsx" URL="apps/artists/core/modules/auth/domain/login-use-case.tsx" fillcolor="#bbfeff"] } } } } } }
    "apps/artists/core/modules/auth/domain/login-use-case.tsx" -> "apps/artists/core/modules/auth/errors/server-error.tsx"
    "apps/artists/core/modules/auth/domain/login-use-case.tsx" -> "apps/artists/core/modules/auth/domain/service/get-from-json.tsx"
    "apps/artists/core/modules/auth/domain/login-use-case.tsx" -> "apps/artists/core/modules/auth/domain/service/save-token.tsx"
    "apps/artists/core/modules/auth/domain/login-use-case.tsx" -> "apps/artists/core/modules/auth/domain/service/validate-dto.tsx"
    "apps/artists/core/modules/auth/domain/login-use-case.tsx" -> "apps/artists/core/modules/auth/domain/service/verify-credentials.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" "apps/artists/core/modules/auth/domain/logout-use-case.tsx" [label=<logout-use-case.tsx> tooltip="logout-use-case.tsx" URL="apps/artists/core/modules/auth/domain/logout-use-case.tsx" fillcolor="#bbfeff"] } } } } } }
    "apps/artists/core/modules/auth/domain/logout-use-case.tsx" -> "apps/artists/core/modules/auth/errors/server-error.tsx"
    "apps/artists/core/modules/auth/domain/logout-use-case.tsx" -> "apps/artists/core/modules/auth/domain/service/delete-auth-cookie.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" subgraph "cluster_apps/artists/core/modules/auth/domain/service" {label="service" "apps/artists/core/modules/auth/domain/service/delete-auth-cookie.tsx" [label=<delete-auth-cookie.tsx> tooltip="delete-auth-cookie.tsx" URL="apps/artists/core/modules/auth/domain/service/delete-auth-cookie.tsx" fillcolor="#bbfeff"] } } } } } } }
    "apps/artists/core/modules/auth/domain/service/delete-auth-cookie.tsx" -> "apps/artists/core/modules/auth/domain/token.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" subgraph "cluster_apps/artists/core/modules/auth/domain/service" {label="service" "apps/artists/core/modules/auth/domain/service/get-auth-client-cookie.tsx" [label=<get-auth-client-cookie.tsx> tooltip="get-auth-client-cookie.tsx" URL="apps/artists/core/modules/auth/domain/service/get-auth-client-cookie.tsx" fillcolor="#bbfeff"] } } } } } } }
    "apps/artists/core/modules/auth/domain/service/get-auth-client-cookie.tsx" -> "apps/artists/core/modules/auth/domain/token.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" subgraph "cluster_apps/artists/core/modules/auth/domain/service" {label="service" "apps/artists/core/modules/auth/domain/service/get-from-json.tsx" [label=<get-from-json.tsx> tooltip="get-from-json.tsx" URL="apps/artists/core/modules/auth/domain/service/get-from-json.tsx" fillcolor="#bbfeff"] } } } } } } }
    "apps/artists/core/modules/auth/domain/service/get-from-json.tsx" -> "apps/artists/core/modules/auth/errors/bad-json-format-error.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" subgraph "cluster_apps/artists/core/modules/auth/domain/service" {label="service" "apps/artists/core/modules/auth/domain/service/save-token.tsx" [label=<save-token.tsx> tooltip="save-token.tsx" URL="apps/artists/core/modules/auth/domain/service/save-token.tsx" fillcolor="#bbfeff"] } } } } } } }
    "apps/artists/core/modules/auth/domain/service/save-token.tsx" -> "apps/artists/core/modules/auth/errors/internal-error.tsx"
    "apps/artists/core/modules/auth/domain/service/save-token.tsx" -> "apps/artists/core/modules/auth/domain/token.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" subgraph "cluster_apps/artists/core/modules/auth/domain/service" {label="service" "apps/artists/core/modules/auth/domain/service/validate-dto.tsx" [label=<validate-dto.tsx> tooltip="validate-dto.tsx" URL="apps/artists/core/modules/auth/domain/service/validate-dto.tsx" fillcolor="#bbfeff"] } } } } } } }
    "apps/artists/core/modules/auth/domain/service/validate-dto.tsx" -> "apps/artists/core/modules/auth/errors/bad-dto-format-error.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" subgraph "cluster_apps/artists/core/modules/auth/domain/service" {label="service" "apps/artists/core/modules/auth/domain/service/verify-credentials.tsx" [label=<verify-credentials.tsx> tooltip="verify-credentials.tsx" URL="apps/artists/core/modules/auth/domain/service/verify-credentials.tsx" fillcolor="#bbfeff"] } } } } } } }
    "apps/artists/core/modules/auth/domain/service/verify-credentials.tsx" -> "apps/artists/core/modules/auth/errors/bad-credentials-error.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/domain" {label="domain" "apps/artists/core/modules/auth/domain/token.tsx" [label=<token.tsx> tooltip="token.tsx" URL="apps/artists/core/modules/auth/domain/token.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/errors" {label="errors" "apps/artists/core/modules/auth/errors/bad-credentials-error.tsx" [label=<bad-credentials-error.tsx> tooltip="bad-credentials-error.tsx" URL="apps/artists/core/modules/auth/errors/bad-credentials-error.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/errors" {label="errors" "apps/artists/core/modules/auth/errors/bad-dto-format-error.tsx" [label=<bad-dto-format-error.tsx> tooltip="bad-dto-format-error.tsx" URL="apps/artists/core/modules/auth/errors/bad-dto-format-error.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/errors" {label="errors" "apps/artists/core/modules/auth/errors/bad-json-format-error.tsx" [label=<bad-json-format-error.tsx> tooltip="bad-json-format-error.tsx" URL="apps/artists/core/modules/auth/errors/bad-json-format-error.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/errors" {label="errors" "apps/artists/core/modules/auth/errors/fetch-error.tsx" [label=<fetch-error.tsx> tooltip="fetch-error.tsx" URL="apps/artists/core/modules/auth/errors/fetch-error.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/errors" {label="errors" "apps/artists/core/modules/auth/errors/internal-error.tsx" [label=<internal-error.tsx> tooltip="internal-error.tsx" URL="apps/artists/core/modules/auth/errors/internal-error.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/errors" {label="errors" "apps/artists/core/modules/auth/errors/server-error.tsx" [label=<server-error.tsx> tooltip="server-error.tsx" URL="apps/artists/core/modules/auth/errors/server-error.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/server" {label="server" "apps/artists/core/modules/auth/server/http-response.tsx" [label=<http-response.tsx> tooltip="http-response.tsx" URL="apps/artists/core/modules/auth/server/http-response.tsx" fillcolor="#bbfeff"] } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/server" {label="server" subgraph "cluster_apps/artists/core/modules/auth/server/login" {label="login" subgraph "cluster_apps/artists/core/modules/auth/server/login/controllers" {label="controllers" "apps/artists/core/modules/auth/server/login/controllers/login-get-controller.tsx" [label=<login-get-controller.tsx> tooltip="login-get-controller.tsx" URL="apps/artists/core/modules/auth/server/login/controllers/login-get-controller.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/server/login/controllers/login-get-controller.tsx" -> "apps/artists/core/modules/auth/server/http-response.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/server" {label="server" subgraph "cluster_apps/artists/core/modules/auth/server/login" {label="login" subgraph "cluster_apps/artists/core/modules/auth/server/login/controllers" {label="controllers" "apps/artists/core/modules/auth/server/login/controllers/login-post-controller.tsx" [label=<login-post-controller.tsx> tooltip="login-post-controller.tsx" URL="apps/artists/core/modules/auth/server/login/controllers/login-post-controller.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/server/login/controllers/login-post-controller.tsx" -> "apps/artists/core/modules/auth/domain/login-use-case.tsx"
    "apps/artists/core/modules/auth/server/login/controllers/login-post-controller.tsx" -> "apps/artists/core/modules/auth/server/http-response.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/server" {label="server" subgraph "cluster_apps/artists/core/modules/auth/server/login" {label="login" "apps/artists/core/modules/auth/server/login/login-post-fetch-result.tsx" [label=<login-post-fetch-result.tsx> tooltip="login-post-fetch-result.tsx" URL="apps/artists/core/modules/auth/server/login/login-post-fetch-result.tsx" fillcolor="#bbfeff"] } } } } } } }
    "apps/artists/core/modules/auth/server/login/login-post-fetch-result.tsx" -> "apps/artists/core/modules/auth/domain/token.tsx"
    "apps/artists/core/modules/auth/server/login/login-post-fetch-result.tsx" -> "apps/artists/core/modules/auth/errors/fetch-error.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/server" {label="server" subgraph "cluster_apps/artists/core/modules/auth/server/logout" {label="logout" subgraph "cluster_apps/artists/core/modules/auth/server/logout/controllers" {label="controllers" "apps/artists/core/modules/auth/server/logout/controllers/logout-get-controller.tsx" [label=<logout-get-controller.tsx> tooltip="logout-get-controller.tsx" URL="apps/artists/core/modules/auth/server/logout/controllers/logout-get-controller.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/server/logout/controllers/logout-get-controller.tsx" -> "apps/artists/core/modules/auth/server/http-response.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/server" {label="server" subgraph "cluster_apps/artists/core/modules/auth/server/logout" {label="logout" subgraph "cluster_apps/artists/core/modules/auth/server/logout/controllers" {label="controllers" "apps/artists/core/modules/auth/server/logout/controllers/logout-post-controller.tsx" [label=<logout-post-controller.tsx> tooltip="logout-post-controller.tsx" URL="apps/artists/core/modules/auth/server/logout/controllers/logout-post-controller.tsx" fillcolor="#bbfeff"] } } } } } } } }
    "apps/artists/core/modules/auth/server/logout/controllers/logout-post-controller.tsx" -> "apps/artists/core/modules/auth/domain/logout-use-case.tsx"
    "apps/artists/core/modules/auth/server/logout/controllers/logout-post-controller.tsx" -> "apps/artists/core/modules/auth/server/http-response.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/auth" {label="auth" subgraph "cluster_apps/artists/core/modules/auth/server" {label="server" subgraph "cluster_apps/artists/core/modules/auth/server/logout" {label="logout" "apps/artists/core/modules/auth/server/logout/logout-post-fetch.tsx" [label=<logout-post-fetch.tsx> tooltip="logout-post-fetch.tsx" URL="apps/artists/core/modules/auth/server/logout/logout-post-fetch.tsx" fillcolor="#bbfeff"] } } } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/environment" {label="environment" "apps/artists/core/modules/environment/environment-display.tsx" [label=<environment-display.tsx> tooltip="environment-display.tsx" URL="apps/artists/core/modules/environment/environment-display.tsx" fillcolor="#bbfeff"] } } } } }
    "apps/artists/core/modules/environment/environment-display.tsx" -> "apps/artists/core/modules/environment/use-environment.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/environment" {label="environment" "apps/artists/core/modules/environment/use-environment.tsx" [label=<use-environment.tsx> tooltip="use-environment.tsx" URL="apps/artists/core/modules/environment/use-environment.tsx" fillcolor="#bbfeff"] } } } } }
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" subgraph "cluster_apps/artists/core" {label="core" subgraph "cluster_apps/artists/core/modules" {label="modules" subgraph "cluster_apps/artists/core/modules/landing" {label="landing" "apps/artists/core/modules/landing/page.tsx" [label=<page.tsx> tooltip="page.tsx" URL="apps/artists/core/modules/landing/page.tsx" fillcolor="#bbfeff"] } } } } }
    "apps/artists/core/modules/landing/page.tsx" -> "apps/artists/settings.tsx"
    "apps/artists/core/modules/landing/page.tsx" -> "apps/artists/core/modules/auth/client/components/auth-section/auth-section.tsx"
    "apps/artists/core/modules/landing/page.tsx" -> "apps/artists/core/modules/environment/environment-display.tsx"
    subgraph "cluster_apps" {label="apps" subgraph "cluster_apps/artists" {label="artists" "apps/artists/settings.tsx" [label=<settings.tsx> tooltip="settings.tsx" URL="apps/artists/settings.tsx" fillcolor="#bbfeff"] } }
}
